In [ ]:
import numpy as np
import pandas as pd

# Функции WHERE & SELECT библиотеки numpy

# Изменение DataFrame по нескольким условиям

In [ ]:
df = pd.read_csv('files/sample_1.csv')
df

      name  age state  point
0    Alice   24    NY     64
1      Bob   42    CA     92
2  Charlie   18    CA     70
3     Dave   68    TX     70
4    Ellen   24    CA     88
5    Frank   30    NY     57

## Базовое использование np.where

In [ ]:
# пример работы функции np.where (Аналог функции 'ЕСЛИ' в Excel)

df['result']=np.where(df['point']>59, 'Passed', 'Failed')
df

      name  age state  point  result
0    Alice   24    NY     64  Passed
1      Bob   42    CA     92  Passed
2  Charlie   18    CA     70  Passed
3     Dave   68    TX     70  Passed
4    Ellen   24    CA     88  Passed
5    Frank   30    NY     57  Failed

## Другие примеры использования np.where

### Пример 1 - Получить индексы строк, удовлетворяющих условию 'возраст < 30'

In [ ]:
inds = np.where(df.age<30)
display(type(inds),inds)

tuple

(array([0, 2, 4], dtype=int64),)

### Пример 2 - Получить данные из конкретного столбца по определенному условию, а если условие не выполняется, получить данные из другой колонки

In [ ]:
result=np.where(df.age<30,  # условие (возраст < 30 лет)
         df.name,    # если условие выполняется, получить имя
         df.point)   # если условие не выполняется, получить результат тестирования
display(type(result), result)

numpy.ndarray

array(['Alice', 92, 'Charlie', 70, 'Ellen', 57], dtype=object)

## Несколько условий. Функция np.select

In [ ]:
df2 = pd.read_csv('files/sample_1.csv')
df2

      name  age state  point
0    Alice   24    NY     64
1      Bob   42    CA     92
2  Charlie   18    CA     70
3     Dave   68    TX     70
4    Ellen   24    CA     88
5    Frank   30    NY     57

### Два условия: если участник прибыл из штата Нью-йорк, мы от полученного результата отнимаем один балл, а если участник - из штата Калифорния, то, наоборот, один бал надо прибавить.

In [ ]:
condlist = [(df2['state']=='NY'),
             (df2['state']=='CA')]
choicelist = [df2['point']-1,
               df2['point']+1]

In [ ]:
# по умолчанию функция select поставит ноль, если не находит соответствие условию (default=0)

df2['new_point'] = np.select(condlist, choicelist)
df2

      name  age state  point  new_point
0    Alice   24    NY     64         63
1      Bob   42    CA     92         93
2  Charlie   18    CA     70         71
3     Dave   68    TX     70          0
4    Ellen   24    CA     88         89
5    Frank   30    NY     57         56

In [ ]:
# указываем в аргументе default колонку с изначальными результатами

df2['new_point'] = np.select(condlist, choicelist, default=df2['point'])
df2

      name  age state  point  new_point
0    Alice   24    NY     64         63
1      Bob   42    CA     92         93
2  Charlie   18    CA     70         71
3     Dave   68    TX     70         70
4    Ellen   24    CA     88         89
5    Frank   30    NY     57         56